# CreateSkylight

## Description
Function CreateSkylight creates a new skylight in the referenced roof object.

```pascal
FUNCTION CreateSkylight(roofObject : HANDLE): INTEGER;
```

```python
def vs.CreateSkylight(roofObject):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|roofObject|HANDLE|Handle to roof.|

## Examples
eateRoofObj}}

## Version
Availability: from VectorWorks8.0

## Category
* Objects - Roofs